templates/rate-calculate.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <AuthHeader xmlns="https://www.xend.com.ph/api/">
      <UserToken>{{ Settings::DEVELOPER_ID }}</UserToken>
    </AuthHeader>
  </soap:Header>
  <soap:Body>
    <Calculate xmlns="https://www.xend.com.ph/api/">
      <ServiceTypeValue>{{ type }}</ServiceTypeValue>
      <ShipmentTypeValue>Parcel</ShipmentTypeValue>
      <!-- <DestinationValue>Manila</DestinationValue> -->
      <Weight>{{ weight }}</Weight>
      <DimensionL>{{ length }}</DimensionL>
      <DimensionW>{{ width }}</DimensionW>
      <DimensionH>{{ height }}</DimensionH>
      <DeclaredValue>{{ params[:value] || 0 }}</DeclaredValue>
      <AddInsurance>{{ params[:value] ? true : false }}</AddInsurance>
    </Calculate>
  </soap:Body>
</soap:Envelope>